
## Plan Result




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_servicebus_subscription_rule.hmctsServiceCode
  * module.servicebus_topic_subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_servicebus_subscription_rule.hmctsServiceCode will be created
  + resource "azurerm_servicebus_subscription_rule" "hmctsServiceCode" {
      + filter_type                    = "SqlFilter"
      + id                             = (known after apply)
      + name                           = "hmc_to_fis_subscription_rule"
      + sql_filter                     = "hmctsServiceCode = 'BBA3'"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = (known after apply)
    }

  # module.servicebus_topic_subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "hmc-fis-subscription-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":25,"Program":"tfcmt","SHA1":"","Vars":{}} -->